brew "asdf"
brew "git"
brew "gpg"
brew "hub"
brew "mas"
brew "pick"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tree"
brew "vim"

tap "thoughtbot/formulae"
brew "rcm"

tap "homebrew/cask-fonts"
cask "font-source-code-pro"

cask "1password"
cask "alacritty"
cask "dash"
cask "firefox"
cask "paw"
cask "shortcuts"
cask "slack"
cask "sourcetree"

mas "Airmail 3", id: 918858936
mas "Bear", id: 1091189122
mas "Fantastical 2", id: 975937182
mas "Things 3", id: 904280696
