brew "asdf"
brew "git"
brew "gpg"
brew "mas"
brew "reattach-to-user-namespace"
brew "tmux"
brew "vim"

tap "thoughtbot/formulae"
brew "rcm"

cask "1password"
cask "opera"
cask "paw"
cask "shortcuts"
cask "slack"
cask "sourcetree"

mas "Airmail 3", id: 918858936
mas "Bear", id: 1091189122
mas "Fantastical 2", id: 975937182
