brew "git"
brew "gpg"
brew "hub"
brew "mas"
brew "pick"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tree"
brew "helix"
brew "asdf"
brew "yazi" # Terminal file management

# Yazi dependencies
brew "file"
brew "ffmpegthumbnailer" 
brew "unar"
brew "jq"
brew "poppler"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# Language servers
brew "elixir-ls" # Elixir LSP
brew "dprint" # Markdown formatter
brew "marksman" # Markdown LSP

# Dot file managemement
tap "thoughtbot/formulae"
brew "rcm"

# Fonts
cask "font-fira-code"
cask "font-symbols-only-nerd-font"

# Applications
cask "1password"
cask "dash"
cask "firefox"
cask "rapidapi"
cask "slack"
cask "obsidian"

mas "Fantastical 2", id: 975937182
mas "Things 3", id: 904280696
